{
    "@odata.type":  "#microsoft.graph.androidCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "78fed40b-23c1-48b2-bdce-af7d3d88114d",
    "createdDateTime":  "2019-05-26T22:06:20.5318912Z",
    "description":  "Block rooted devices, Require Google Play services and the Verify apps feature",
    "lastModifiedDateTime":  "2019-07-07T21:43:31.1519751Z",
    "displayName":  "Android Compliance Policy",
    "version":  3,
    "passwordRequired":  true,
    "passwordMinimumLength":  4,
    "passwordRequiredType":  "numeric",
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordExpirationDays":  null,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "securityPreventInstallAppsFromUnknownSources":  false,
    "securityDisableUsbDebugging":  false,
    "securityRequireVerifyApps":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "securityBlockJailbrokenDevices":  true,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "minAndroidSecurityPatchLevel":  null,
    "storageRequireEncryption":  true,
    "securityRequireSafetyNetAttestationBasicIntegrity":  false,
    "securityRequireSafetyNetAttestationCertifiedDevice":  false,
    "securityRequireGooglePlayServices":  false,
    "securityRequireUpToDateSecurityProviders":  false,
    "securityRequireCompanyPortalAppIntegrity":  true,
    "conditionStatementId":  null,
    "restrictedApps":  [

                       ]
}
