{
    "@odata.type":  "#microsoft.graph.androidWorkProfileCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "38f6ee76-acae-4894-8df4-ddaea854da4e",
    "createdDateTime":  "2019-06-08T17:02:14.4143843Z",
    "description":  "",
    "lastModifiedDateTime":  "2019-07-07T21:43:40.702828Z",
    "displayName":  "Android Enterprise Compliance policy",
    "version":  2,
    "passwordRequired":  true,
    "passwordMinimumLength":  4,
    "passwordRequiredType":  "numeric",
    "passwordMinutesOfInactivityBeforeLock":  5,
    "passwordExpirationDays":  null,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "securityPreventInstallAppsFromUnknownSources":  true,
    "securityDisableUsbDebugging":  false,
    "securityRequireVerifyApps":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "securityBlockJailbrokenDevices":  true,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "minAndroidSecurityPatchLevel":  null,
    "storageRequireEncryption":  true,
    "securityRequireSafetyNetAttestationBasicIntegrity":  true,
    "securityRequireSafetyNetAttestationCertifiedDevice":  false,
    "securityRequireGooglePlayServices":  true,
    "securityRequireUpToDateSecurityProviders":  true,
    "securityRequireCompanyPortalAppIntegrity":  true
}
