{
    "@odata.type":  "#microsoft.graph.macOSGeneralDeviceConfiguration",
    "id":  "dea04720-0848-463d-a143-384a196671ad",
    "lastModifiedDateTime":  "2019-05-26T22:06:22.7037805Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2019-05-26T22:06:22.7037805Z",
    "description":  "Enforce device password",
    "displayName":  "macOS Baseline Config",
    "version":  1,
    "compliantAppListType":  "none",
    "emailInDomainSuffixes":  [

                              ],
    "passwordBlockSimple":  true,
    "passwordExpirationDays":  null,
    "passwordMinimumCharacterSetCount":  null,
    "passwordMinimumLength":  null,
    "passwordMinutesOfInactivityBeforeLock":  0,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  10,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordRequiredType":  "deviceDefault",
    "passwordRequired":  true,
    "keychainBlockCloudSync":  false,
    "airPrintBlocked":  false,
    "airPrintForceTrustedTLS":  false,
    "airPrintBlockiBeaconDiscovery":  false,
    "safariBlockAutofill":  false,
    "cameraBlocked":  false,
    "iTunesBlockMusicService":  false,
    "spotlightBlockInternetResults":  false,
    "keyboardBlockDictation":  false,
    "definitionLookupBlocked":  false,
    "appleWatchBlockAutoUnlock":  false,
    "iTunesBlockFileSharing":  false,
    "iCloudBlockDocumentSync":  false,
    "iCloudBlockMail":  false,
    "iCloudBlockAddressBook":  false,
    "iCloudBlockCalendar":  false,
    "iCloudBlockReminders":  false,
    "iCloudBlockBookmarks":  false,
    "iCloudBlockNotes":  false,
    "airDropBlocked":  false,
    "passwordBlockModification":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockAutoFill":  false,
    "passwordBlockProximityRequests":  false,
    "passwordBlockAirDropSharing":  false,
    "softwareUpdatesEnforcedDelayInDays":  null,
    "softwareUpdatesForceDelayed":  false,
    "contentCachingBlocked":  false,
    "iCloudBlockPhotoLibrary":  false,
    "screenCaptureBlocked":  false,
    "classroomAppBlockRemoteScreenObservation":  false,
    "classroomAppForceUnpromptedScreenObservation":  false,
    "classroomForceAutomaticallyJoinClasses":  false,
    "classroomForceRequestPermissionToLeaveClasses":  false,
    "classroomForceUnpromptedAppAndDeviceLock":  false,
    "iCloudBlockActivityContinuation":  false,
    "compliantAppsList":  [

                          ]
}
