{
    "@odata.type":  "#microsoft.graph.macOSEndpointProtectionConfiguration",
    "roleScopeTagIds":  [

                        ],
    "supportsScopeTags":  true,
    "description":  "Enable Firewall with Stealth mode",
    "displayName":  "macOS Baseline Endpoint Protection",
    "gatekeeperAllowedAppSource":  "notConfigured",
    "gatekeeperBlockOverride":  false,
    "firewallEnabled":  true,
    "firewallBlockAllIncoming":  false,
    "firewallEnableStealthMode":  true,
    "firewallApplications":  [

                             ]
}
